cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'cmake'
brew 'coreutils'
brew 'erlang'
brew 'imagemagick'
brew 'libgit2'
brew 'md5sha1sum'
brew 'openssl'
brew 'pyenv'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'sbt'
brew 'tmux'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'youtube-dl'

cask 'docker-toolbox'
cask 'firefox'
cask 'google-chrome'
cask 'intellij-idea'
cask 'iterm2'
cask 'libreoffice'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'vlc'
cask 'whatsapp'
